; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	spectrograph0 - mode
	infrared1 - mode
	infrared2 - mode
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation9 - direction
	GroundStation7 - direction
	Star0 - direction
	GroundStation6 - direction
	Star5 - direction
	GroundStation10 - direction
	Star2 - direction
	GroundStation11 - direction
	Star8 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star8)
	(supports instrument1 infrared2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star5)
	(supports instrument2 infrared1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 GroundStation11)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation7)
	(supports instrument4 infrared2)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation11)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star8)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 Star8)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation10)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation10)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation6)
	(supports instrument7 infrared1)
	(calibration_target instrument7 Star2)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 Star8)
	(calibration_target instrument8 GroundStation11)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
)
(:goal (and
	(pointing satellite1 GroundStation7)
	(pointing satellite2 Star15)
	(have_image Phenomenon12 infrared2)
	(have_image Star13 spectrograph0)
	(have_image Star14 infrared2)
	(have_image Star15 spectrograph0)
	(have_image Phenomenon16 infrared1)
	(have_image Phenomenon17 infrared2)
))

)

; plan
1. (switch_on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 0 of 8
2. (calibrate satellite2 instrument8 star8)
   added: (calibrated instrument8)
   goals met: 0 of 8
3. (turn_to satellite2 star13 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star13)
   goals met: 0 of 8
4. (take_image satellite2 star13 instrument8 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 1 of 8
5. (turn_to satellite2 star15 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star15)
   goals met: 2 of 8
6. (take_image satellite2 star15 instrument8 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 3 of 8
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 8
8. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 3 of 8
9. (turn_to satellite0 phenomenon12 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 8
10. (take_image satellite0 phenomenon12 instrument1 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 4 of 8
11. (turn_to satellite0 phenomenon16 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon16)
   goals met: 4 of 8
12. (take_image satellite0 phenomenon16 instrument1 infrared1)
   added: (have_image phenomenon16 infrared1)
   goals met: 5 of 8
13. (turn_to satellite0 phenomenon17 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon17)
   goals met: 5 of 8
14. (take_image satellite0 phenomenon17 instrument1 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 6 of 8
15. (turn_to satellite0 star14 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star14)
   goals met: 6 of 8
16. (take_image satellite0 star14 instrument1 infrared2)
   added: (have_image star14 infrared2)
   goals met: 7 of 8
17. (turn_to satellite1 groundstation7 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 groundstation7)
   goals met: 8 of 8
